src/cf/InformationRegisters/ор_ИсторияЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ор_ИсторияЗагрузки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НастройкаЗагрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяЗагружаемогоФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусОшибки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ор_СтатусыОшибок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФоноваяЗагрузка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НумераторСообщений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Каталог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ор_ИсторияЗагрузки/Forms/СокращениеЖурнала/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьДиапазонСобытий();
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СократитьЖурнал(Команда)
	
	Если ДатаУдаления = '00010101' Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана дата, до которой будут удалены записи");
		Возврат;
	КонецЕсли;
	
	СократитьЖурналСервер();
	ЭтаФорма.Закрыть();
	
КонецПроцедуры // СократитьЖурнал()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура формирует и заполняет текущий диапазон зарегистрированных событий
// в журнале касс ККМ
//
&НаСервере
Процедура ЗаполнитьДиапазонСобытий()
	
	// Определим диапазон событий журнала по датам первой и последней записей
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИсторияЗагрузки.ДатаЗагрузки КАК Дата
	|ПОМЕСТИТЬ НачПериода
	|ИЗ
	|	РегистрСведений.ор_ИсторияЗагрузки КАК ИсторияЗагрузки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	НачПериода.Дата КАК НачалоПериода,
	|	ИсторияЗагрузки.ДатаЗагрузки КАК КонецПериода
	|ИЗ
	|	РегистрСведений.ор_ИсторияЗагрузки КАК ИсторияЗагрузки,
	|	НачПериода КАК НачПериода
	|
	|УПОРЯДОЧИТЬ ПО
	|	КонецПериода УБЫВ";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Элементы.ДекорацияЗначениеДиапазонаСобытий.Заголовок = "... - ...";
	Иначе
		Диапазон = РезультатЗапроса.Выгрузить();
		Элементы.ДекорацияЗначениеДиапазонаСобытий.Заголовок = Формат(Диапазон[0].НачалоПериода,"ДФ=dd.MM.yyyy")+" - "+Формат(Диапазон[0].КонецПериода, "ДФ=dd.MM.yyyy");
	КонецЕсли;
	

КонецПроцедуры // ЗаполнитьДиапазонСобытий()

// Процедура выполняет сокращение журнала событий касс ККМ
//
&НаСервере
Процедура СократитьЖурналСервер()
	
	// Сформируем текст запроса
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ИсторияЗагрузки.НастройкаЗагрузки,
	|	ИсторияЗагрузки.ДатаЗагрузки,
	|	ИсторияЗагрузки.ИмяЗагружаемогоФайла,
	|	ИсторияЗагрузки.СтатусОшибки,
	|	ИсторияЗагрузки.Объект,
	|	ИсторияЗагрузки.ФоноваяЗагрузка,
	|	ИсторияЗагрузки.Контрагент,
	|	ИсторияЗагрузки.ДатаНачалаЗагрузки,
	|	ИсторияЗагрузки.НумераторСообщений,
	|	ИсторияЗагрузки.Каталог,
	|	ИсторияЗагрузки.Сообщение
	|ИЗ
	|	РегистрСведений.ор_ИсторияЗагрузки КАК ИсторияЗагрузки
	|ГДЕ
	|	ИсторияЗагрузки.ДатаЗагрузки > &Дата";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Дата", КонецДня(ДатаУдаления));
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	Попытка
		НаборЗаписей = РегистрыСведений.ор_ИсторияЗагрузки.СоздатьНаборЗаписей();
		НаборЗаписей.Прочитать();
		НаборЗаписей.Загрузить(ТаблицаДанных);
		НаборЗаписей.Записать();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось удалить записи");
	КонецПопытки;
	
КонецПроцедуры // СократитьЖурналСервер()

#КонецОбласти
